# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [3]:
import requests
import io
import pandas as pd
import numpy as np
import csv
from bs4 import BeautifulSoup

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [16]:
user_id = requests.get("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user").content
soup = BeautifulSoup(user_id)
x =soup.text
with open ("data.txt", "w") as txt: 
    data = txt.writelines(x)
df = pd.read_csv("data.txt",header=None,names=["hello"])
df['hello'] = df['hello'].str.replace('|',' ')

df[['First','sec','third','fouth','fifth']] = df.hello.str.split(" ",expand=True,)


df.drop(df.columns[[0]], axis=1, inplace=True)
df.to_csv("dd.csv",header=1)


dff=pd.read_csv("dd.csv",header=1)
dff

<ipython-input-16-ca0b1b3ca620>:7: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df['hello'] = df['hello'].str.replace('|',' ')

       0  user_id  age gender     occupation zip_code
0      1        1   24      M     technician    85711
1      2        2   53      F          other    94043
2      3        3   23      M         writer    32067
3      4        4   24      M     technician    43537
4      5        5   33      F          other    15213
..   ...      ...  ...    ...            ...      ...
938  939      939   26      F        student    33319
939  940      940   32      M  administrator    02215
940  941      941   20      M        student    97229
941  942      942   48      F      librarian    78209
942  943      943   22      M        student    77841

[943 rows x 6 columns]

### Step 4. See the first 25 entries

In [17]:
dff.columns.to_list()

['0', 'user_id', 'age', 'gender', 'occupation', 'zip_code']

### Step 5. See the last 10 entries

In [18]:
dff.head(10)

    0  user_id  age gender     occupation zip_code
0   1        1   24      M     technician    85711
1   2        2   53      F          other    94043
2   3        3   23      M         writer    32067
3   4        4   24      M     technician    43537
4   5        5   33      F          other    15213
5   6        6   42      M      executive    98101
6   7        7   57      M  administrator    91344
7   8        8   36      M  administrator    05201
8   9        9   29      M        student    01002
9  10       10   53      M         lawyer    90703

### Step 6. What is the number of observations in the dataset?

In [19]:
dff.count()

0             943
user_id       943
age           943
gender        943
occupation    943
zip_code      943
dtype: int64

### Step 7. What is the number of columns in the dataset?

In [20]:
len(dff.columns)

6

### Step 8. Print the name of all the columns.

In [23]:
y = dff.columns.to_list()
for i in y:
    print(i)

0
user_id
age
gender
occupation
zip_code

### Step 9. How is the dataset indexed?

In [24]:
dff.index

RangeIndex(start=0, stop=943, step=1)

### Step 10. What is the data type of each column?

In [29]:
dff.dtypes

0              int64
user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [32]:
dff["occupation"]

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [34]:
dff['occupation'].count()

943

### Step 13. What is the most frequent occupation?

In [43]:
dff['occupation'].mode()

0    student
dtype: object

### Step 14. Summarize the DataFrame.

In [39]:
dff.describe()

                0     user_id         age
count  943.000000  943.000000  943.000000
mean   472.000000  472.000000   34.051962
std    272.364951  272.364951   12.192740
min      1.000000    1.000000    7.000000
25%    236.500000  236.500000   25.000000
50%    472.000000  472.000000   31.000000
75%    707.500000  707.500000   43.000000
max    943.000000  943.000000   73.000000

### Step 15. Summarize all the columns

In [46]:
dff.describe(include= 'all')

                 0     user_id         age gender occupation zip_code
count   943.000000  943.000000  943.000000    943        943      943
unique         NaN         NaN         NaN      2         21      795
top            NaN         NaN         NaN      M    student    55414
freq           NaN         NaN         NaN    670        196        9
mean    472.000000  472.000000   34.051962    NaN        NaN      NaN
std     272.364951  272.364951   12.192740    NaN        NaN      NaN
min       1.000000    1.000000    7.000000    NaN        NaN      NaN
25%     236.500000  236.500000   25.000000    NaN        NaN      NaN
50%     472.000000  472.000000   31.000000    NaN        NaN      NaN
75%     707.500000  707.500000   43.000000    NaN        NaN      NaN
max     943.000000  943.000000   73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [40]:
dff["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [44]:
dff["age"].mean()

34.05196182396607

### Step 18. What is the age with least occurrence?